run/mShock_oneStepGlobal_2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    // div(phi,Yi)   Gauss vanLeer;

    // div(phi,Yi)   Gauss multivariateSelection
    // {
    //     air             limitedLinear01 1;
    //     H2O             limitedLinear01 1;
    //     h               limitedLinear 1;
    // };
    
    // div(phi,epsilon) Gauss limitedLinear 1;
    // div(phi,k) Gauss limitedLinear 1;
    // div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;

    // reconstruct(rho) vanAlbada;
    // reconstruct(U)  vanAlbadaV;
    // reconstruct(T)  vanAlbada;

    reconstruct(rho) vanLeer;
    reconstruct(U)   vanLeerV; //linearUpwindV grad(U); //upwind; //vanLeerV;
    reconstruct(T)   vanLeer;
    
    // reconstruct(rho) linearUpwind grad(U);
    // reconstruct(U)   linearUpwindV grad(U); //upwind; //vanLeerV;
    // reconstruct(T)   linearUpwind grad(U);

    flux(rhoU)      linear;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
